Конфигурация/Documents/Распоряжение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Распоряжение</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид подчиненного документа</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийБэкОфиса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРазмещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьВыплатыПроцентов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностиВыплатыПроцентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетВозвратаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоВостребования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентнаяСтавкаПриДосрочномЗакрытии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субординированность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Биржевой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодОжидаемыйКупон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Enums/ВидыОперацийБэкОфиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОперацийБэкОфиса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктПриемаПередачиОбъектовНедвижимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводОстатковАктивовСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводПрочихАктивов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключениеПрочегоИмуществаВСоставПИФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачислениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеУсловийСделки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеОбязательствПоСделке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеОбязательствПоСделкеСПФИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеРешенияОбИзмененииУставногоКапиталаООО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонвертацияЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаРегистров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Маржа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеДивидендов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеРезервовПИФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеСписаниеРезервов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаСделки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеКупона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеЦеннойБумаги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаДвижениеДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаДвижениеЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоставкаЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПроцентовМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПроцентовПоКредитномуИнструменту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмещениеКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеДоходаПайщикам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОбИзмененииУставногоКапиталаООО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОРегистрацииПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводнаяБиржеваяСделка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводноеИсполнениеОбязательствПоБиржевымСделкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сделка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаРЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСВалютой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСМО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСНедвижимостью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСПФИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеЦеннойБумагиСУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеЗадолженностейПоПоручению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеЦеннойБумаги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СторнированиеМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Распоряжение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/МНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>МНО</Name>
			<BasedOn>
				<xr:Item>Document.Распоряжение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредстваМНО</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Распоряжение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/РазмещениеКредитногоИнструмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РазмещениеКредитногоИнструмента</Name>
			<BasedOn>
				<xr:Item>Document.Распоряжение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваВКредитныхИнструментах</xr:Item>
				<xr:Item>InformationRegister.НоминалыКредитныхИнструментов</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.РеестрПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Распоряжение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Довнесение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КредитныйИнструмент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КредитныеИнструменты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаБанковскойВыписки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/Распоряжение/Ext/ObjectModule.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
	// очистим персонифицированные реквизиты
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, "ДатаВозврата, Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента Тогда
		
		Если Не ЗначениеЗаполнено(ЭтотОбъект.Банк) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Значение поля [Банк] не заполнено",, "Объект.Банк",, Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ЭтотОбъект.ДатаРазмещения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Значение поля [Дата размещения] не заполнено",, "Объект.ДатаРазмещения",, Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ЭтотОбъект.ПериодичностьВыплатыПроцентов) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Значение поля [Периодичность выплаты процентов] не заполнено",, "Объект.ПериодичностьВыплатыПроцентов",, Отказ);
		КонецЕсли;

		Если ПроверяемыеРеквизиты.Найти("РасчетныйСчет") <> Неопределено И ЭтотОбъект.Биржевой Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("РасчетныйСчет"));
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ЭтотОбъект.РасчетныйСчетВозвратаДенежныхСредств) И Не ЭтотОбъект.Биржевой Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Значение поля [Расчетный счет возврата денежных средств] не заполнено",, "Объект.РасчетныйСчетВозвратаДенежныхСредств",, Отказ);
		КонецЕсли;
		
		Если ЭтотОбъект.ДоВостребования И Не ЗначениеЗаполнено(ЭтотОбъект.ПроцентнаяСтавкаПриДосрочномЗакрытии) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Значение поля [Процентная ставка при досрочном закрытии депозита] не заполнено",, "Объект.ПроцентнаяСтавкаПриДосрочномЗакрытии",, Отказ);	
		КонецЕсли;
		
	КонецЕсли;
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, Ложь);
	
	Если ЭтотОбъект.ПометкаУдаления 
		И ЭтотОбъект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийБэкОфиса.МНО")
		И РаботаСДокументами.ДействуетКонтрольНаличияНомеровПодтверждения(ЭтотОбъект.Дата, ЭтотОбъект.Организация) Тогда
													
		ЗарегистрированныеНомера = РегистрыСведений.НомераОбъектов.ПолучитьЗарегистрированныеНомера(
									ЭтотОбъект.Организация,
									Справочники.ВидыНумерацииОбъектов.РаспоряженияНаМНО,
									РаботаСКоллекциями.ЗначениеВМассив(ЭтотОбъект.Ссылка),
									ЭтотОбъект.СчетДоверительногоУправления,
									Год(ЭтотОбъект.Дата));
		
		Если ЗарегистрированныеНомера <> Неопределено Тогда
			
			ТекНомерПодтверждения = РаботаСоСтрокамиКлиентСервер.СократитьЛидирующиеНули(ЗарегистрированныеНомера[ЭтотОбъект.Ссылка]);							
								
			Если ЗначениеЗаполнено(ТекНомерПодтверждения) И Не (РольДоступна("ПолныеПрава") Или РольДоступна("ОперацииБэкОфиса")) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Распоряжению присвоен номер [" + ТекНомерПодтверждения + "]. Для отмены распоряжения обратитесь в бэк-офис.'"),,,, Отказ);								
			КонецЕсли;
			
		КонецЕсли;
							
		Возврат;
				
	КонецЕсли;
		
	// блокирующие проверки
	Если ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента Тогда
		
		Если ЭтотОбъект.ДатаРазмещения > ЭтотОбъект.ДатаВозврата Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Дата возврата меньше даты размещения депозита.'"), ЭтотОбъект, "ДатаВозврата",, Отказ);
		КонецЕсли;
		
	Иначе
		
		Если ЭтотОбъект.Дата > ЭтотОбъект.ДатаВозврата Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Дата возврата МНО меньше даты документа.'"), ЭтотОбъект, "ДатаВозврата",, Отказ);
		КонецЕсли;
		
		Если Не (ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ")
				Или ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.РасчетныйСчет, "ДоговорМНО"))) Тогда
				
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='В расчетном счете " + ЭтотОбъект.РасчетныйСчет + " отсутствует соглашение МНО.'"), ЭтотОбъект, "РасчетныйСчет",, Отказ);	
			
		КонецЕсли;
		
		Если Не ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый Тогда
				
			ДатаАкцепта = РаботаСДокументами.ПолучитьДатуАкцептования(ЭтотОбъект.Ссылка, ЭтотОбъект.Организация); 
			
			Если ЗначениеЗаполнено(ДатаАкцепта) И ДатаАкцепта < ЭтотОбъект.Дата Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата распоряжения [" + ЭтотОбъект.Дата + "] не может быть позже даты акцепта [" + ДатаАкцепта + "]", ЭтотОбъект, "Дата",, Отказ);		
			КонецЕсли;

		КонецЕсли;		
		
	КонецЕсли; 

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
#Область Текст_Запроса
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокМНО.*
		|ПОМЕСТИТЬ _ПодчиненныйДокМНО
		|ИЗ
		|	Документ.МНО КАК ДокМНО
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СторнированиеМНО КАК ДокСторнирование
		|		ПО ДокМНО.Ссылка = ДокСторнирование.МНО
		|			И (ДокСторнирование.Проведен)
		|ГДЕ
		|	&ЭтоРаспоряжениеНаМНО
		|	И ДокМНО.Основание = &Ссылка
		|	И ДокМНО.Проведен
		|	И ДокСторнирование.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Распоряжение.СчетДоверительногоУправления КАК СчетДУ,
		|	Распоряжение.Процент КАК Процент
		|ИЗ
		|	Документ.Распоряжение КАК Распоряжение
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МНО КАК ДокМНО
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СторнированиеМНО КАК ДокСторнирование
		|			ПО ДокМНО.Ссылка = ДокСторнирование.МНО
		|				И (ДокСторнирование.Проведен)
		|		ПО Распоряжение.Ссылка = ДокМНО.Основание
		|ГДЕ
		|	&НеПройденКонтрольКонфликтаИнтересов
		|	И НЕ Распоряжение.ПометкаУдаления
		|	И Распоряжение.Организация = &Организация
		|	И НАЧАЛОПЕРИОДА(Распоряжение.Дата, ДЕНЬ) = &НачалоДня
		|	И Распоряжение.ВидОперации = &ВидОперации
		|	И Распоряжение.ДатаРазмещения = &ДатаРазмещения
		|	И Распоряжение.ДатаВозврата = &ДатаВозврата
		|	И Распоряжение.Валюта = &Валюта
		|	И ДокСторнирование.Ссылка ЕСТЬ NULL
		|	И (&ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО)
		|				И Распоряжение.РасчетныйСчет.Банк.Код = &БИК
		|			ИЛИ &ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента)
		|				И Распоряжение.Банк.Код = &БИК)
		|	И (&ЭтоСобственныйПортфель
		|				И Распоряжение.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
		|				И Распоряжение.Процент < &Процент
		|			ИЛИ НЕ &ЭтоСобственныйПортфель
		|				И Распоряжение.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
		|				И Распоряжение.Процент > &Процент)";
#КонецОбласти

    Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ВидОперации", ЭтотОбъект.ВидОперации);
	Запрос.УстановитьПараметр("ДатаРазмещения", ЭтотОбъект.ДатаРазмещения);
	Запрос.УстановитьПараметр("ДатаВозврата", ЭтотОбъект.ДатаВозврата);
	Запрос.УстановитьПараметр("Валюта", ЭтотОбъект.Валюта);
	Запрос.УстановитьПараметр("Процент", ЭтотОбъект.Процент);
	Запрос.УстановитьПараметр("ЭтоСобственныйПортфель", 
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления") = Перечисления.ВидыДоговоровДоверительногоУправления.Собственный);
	Запрос.УстановитьПараметр("ЭтоРаспоряжениеНаМНО", ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийБэкОфиса.МНО);
	Запрос.УстановитьПараметр("НеНовыйДокумент", Не ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый);
	Запрос.УстановитьПараметр("НеПройденКонтрольКонфликтаИнтересов", Не ЭтотОбъект.ДополнительныеСвойства.Свойство("ПройденКонтрольКонфликтаИнтересов"));
	
	БикБанка = "";
	
	Если ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийБэкОфиса.МНО Тогда		
		БикБанка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.РасчетныйСчет, "Банк"), "Код"); 
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента Тогда
		БикБанка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Банк, "Код");
	КонецЕсли;
		
	Если ЗначениеЗаполнено(БикБанка) Тогда
		Запрос.УстановитьПараметр("БИК", БикБанка);	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определеть БИК банка.",,,, Отказ);
		Возврат;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Распоряжение не прошло проверку конфликта интересов."
			+ " В учетной системе присутсвует распоряжение по счету д/у [" + Выборка.СчетДУ + "] и процентной ставкой [" + Выборка.Процент + "]",,,, Отказ);
		Возврат;
	КонецЕсли; 
	
	Если ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийБэкОфиса.МНО Тогда
	
		ВыборкаМНО = Запрос.МенеджерВременныхТаблиц.Таблицы["_ПодчиненныйДокМНО"].ПолучитьДанные().Выбрать();
		
		Если ВыборкаМНО.Следующий() Тогда
			
			ПроверяемыеРеквизиты = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("Организация,СчетДоверительногоУправления,РасчетныйСчет,Процент,Сумма,ДатаВозврата", ",", Истина, Истина);
								
			Для Каждого ИмяРеквизита Из ПроверяемыеРеквизиты Цикл
				
				Если ВыборкаМНО[ИмяРеквизита] <> ЭтотОбъект[ИмяРеквизита] Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Значение поля [" + ИмяРеквизита + "] не совпадает со значением [" + ВыборкаМНО[ИмяРеквизита] + "] в МНО, введенном на основании",, ИмяРеквизита,, Отказ);
				КонецЕсли;
				
			КонецЦикла;
					
		КонецЕсли;
		
	КонецЕсли;
	 	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект); 
										
	Если Не ЭтотОбъект.ПометкаУдаления И ЭтотОбъект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийБэкОфиса.МНО")
		И РаботаСДокументами.ДействуетКонтрольНаличияНомеровПодтверждения(ЭтотОбъект.Дата, ЭтотОбъект.Организация) Тогда 
				
		ВидНумерацииРаспоряжения = Справочники.ВидыНумерацииОбъектов.ПолучитьВидНумерацииОперации(ТипЗнч(ЭтотОбъект.Ссылка), ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Банк, ЭтотОбъект.ВидОперации);
		
		Если ЗначениеЗаполнено(ВидНумерацииРаспоряжения) Тогда
			
			УстановитьПривилегированныйРежим(Истина);	

			РегистрыСведений.НомераОбъектов.ЗарегистрироватьНовыйНомер(
				ЭтотОбъект.Организация, 
				ВидНумерацииРаспоряжения, 
				ЭтотОбъект.Ссылка, 
				ЭтотОбъект.СчетДоверительногоУправления, 
				Год(ЭтотОбъект.Дата), 
				Отказ);  	
			
			УстановитьПривилегированныйРежим(Ложь);
			
			Если Отказ Тогда
				Возврат;
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЕсли;
		
	Если ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента Тогда
		
		Если Не ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый И Не РаботаСПользователями.ЭтоПолноправныйПользователь() Тогда
			
			Запрос = Новый Запрос;
			
	#Область ТЕКСТ_ЗАПРОСА
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Распоряжение.Ссылка КАК Распоряжение,
				|	Распоряжение.Дата КАК Дата,
				|	Распоряжение.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
				|	Распоряжение.РасчетныйСчет КАК РасчетныйСчет,
				|	Распоряжение.Процент КАК Процент,
				|	Распоряжение.ДатаРазмещения КАК ДатаРазмещения,
				|	Распоряжение.ДатаВозврата КАК ДатаВозврата,
				|	Распоряжение.Банк КАК Банк,
				|	Распоряжение.Сумма КАК Сумма,
				|	Распоряжение.Валюта КАК Валюта,
				|	Распоряжение.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
				|	Распоряжение.РасчетныйСчетВозвратаДенежныхСредств КАК РасчетныйСчетВозвратаДенежныхСредств,
				|	Распоряжение.ДоВостребования КАК ДоВостребования,
				|	Распоряжение.ПроцентнаяСтавкаПриДосрочномЗакрытии КАК ПроцентнаяСтавкаДоВостребования,
				|	Распоряжение.Субординированность КАК Субординированность,
				|	РазмещениеКредитногоИнструмента.Ссылка КАК РазмещениеКредитногоИнструмента,
				|	РазмещениеКредитногоИнструмента.СчетДоверительногоУправления КАК СчетДоверительногоУправленияРазмещение,
				|	РазмещениеКредитногоИнструмента.РасчетныйСчет КАК РасчетныйСчетРазмещение,
				|	РазмещениеКредитногоИнструмента.Сумма КАК СуммаРазмещение,
				|	РазмещениеКредитногоИнструмента.КредитныйИнструмент КАК КредитныйИнструмент
				|ПОМЕСТИТЬ _ЗначенияРеквизитовРаспоряженияИРазмещения
				|ИЗ
				|	Документ.Распоряжение КАК Распоряжение
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РазмещениеКредитногоИнструмента КАК РазмещениеКредитногоИнструмента
				|		ПО Распоряжение.Ссылка = РазмещениеКредитногоИнструмента.Основание
				|			И (Распоряжение.Ссылка = &Ссылка)
				|			И (РазмещениеКредитногоИнструмента.Проведен)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ВложенныйЗапрос.Распоряжение КАК Распоряжение,
				|	ДепозитныеВклады.Ссылка КАК ДепозитныйВклад,
				|	ДепозитныеВклады._НачальныйНоминал КАК _НачальныйНоминал,
				|	ДепозитныеВклады.БанковскийСчет.Валюта КАК Валюта,
				|	ДепозитныеВклады.ДатаРегистрации КАК ДатаРазмещения,
				|	ДепозитныеВклады.ДоВостребования КАК ДоВостребования,
				|	ДепозитныеВклады.Субординированность КАК Субординированность,
				|	ДепозитныеВклады.ПроцентнаяСтавкаПриДосрочномЗакрытии КАК ПроцентнаяСтавкаДоВостребования,
				|	УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
				|	УсловияКредитныхИнструментовСрезПоследних.Процент КАК Процент,
				|	УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаВозврата,
				|	УсловияКредитныхИнструментовСрезПоследних.РасчетныйСчетВозвратаДенежныхСредств КАК РасчетныйСчетВозвратаДенежныхСредств,
				|	УсловияКредитныхИнструментовСрезПоследних.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов
				|ПОМЕСТИТЬ _УсловияВклада
				|ИЗ
				|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|		РазмещениеКредитногоИнструмента.Основание КАК Распоряжение,
				|		РазмещениеКредитногоИнструмента.КредитныйИнструмент КАК КредитныйИнструмент 
				|		ИЗ
				|			Документ.РазмещениеКредитногоИнструмента КАК РазмещениеКредитногоИнструмента 
				|		ГДЕ
				|			РазмещениеКредитногоИнструмента.Основание = &Ссылка) КАК ВложенныйЗапрос 
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДепозитныеВклады КАК ДепозитныеВклады
				|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
				|					&ДатаРазмещения,
				|					КредитныйИнструмент В
				|						(ВЫБРАТЬ
				|							_ЗначенияРеквизитовРаспоряженияИРазмещения.КредитныйИнструмент
				|						ИЗ
				|							_ЗначенияРеквизитовРаспоряженияИРазмещения КАК _ЗначенияРеквизитовРаспоряженияИРазмещения)) КАК УсловияКредитныхИнструментовСрезПоследних
				|			ПО ДепозитныеВклады.ДатаРегистрации = УсловияКредитныхИнструментовСрезПоследних.Период
				|				И ДепозитныеВклады.Ссылка = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
				|				И (УсловияКредитныхИнструментовСрезПоследних.Действует)
				|		ПО ВложенныйЗапрос.КредитныйИнструмент = ДепозитныеВклады.Ссылка
				|			И (НЕ ДепозитныеВклады.ПометкаУдаления)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	""Редактирование документа запрещено! На основании распоряжения создан документ [%1]."" КАК ТекстСообщения,
				|	_ЗначенияРеквизитовРаспоряженияИРазмещения.РазмещениеКредитногоИнструмента КАК Параметр1
				|ИЗ
				|	_ЗначенияРеквизитовРаспоряженияИРазмещения КАК _ЗначенияРеквизитовРаспоряженияИРазмещения
				|ГДЕ
				|	(_ЗначенияРеквизитовРаспоряженияИРазмещения.СчетДоверительногоУправления <> _ЗначенияРеквизитовРаспоряженияИРазмещения.СчетДоверительногоУправленияРазмещение
				|			ИЛИ _ЗначенияРеквизитовРаспоряженияИРазмещения.РасчетныйСчет <> _ЗначенияРеквизитовРаспоряженияИРазмещения.РасчетныйСчетРазмещение
				|			ИЛИ _ЗначенияРеквизитовРаспоряженияИРазмещения.Сумма <> _ЗначенияРеквизитовРаспоряженияИРазмещения.СуммаРазмещение)
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ
				|	""Редактирование документа запрещено! На основании данных распоряжения сформирован депозитный вклад [%1]."",
				|	_ЗначенияРеквизитовРаспоряженияИРазмещения.КредитныйИнструмент
				|ИЗ
				|	_ЗначенияРеквизитовРаспоряженияИРазмещения КАК _ЗначенияРеквизитовРаспоряженияИРазмещения
				|		ЛЕВОЕ СОЕДИНЕНИЕ _УсловияВклада КАК _УсловияВклада
				|		ПО _ЗначенияРеквизитовРаспоряженияИРазмещения.Распоряжение = _УсловияВклада.Распоряжение
				|ГДЕ
				|	(_ЗначенияРеквизитовРаспоряженияИРазмещения.Сумма <> _УсловияВклада._НачальныйНоминал
				|			ИЛИ _ЗначенияРеквизитовРаспоряженияИРазмещения.Валюта <> _УсловияВклада.Валюта
				|			ИЛИ _ЗначенияРеквизитовРаспоряженияИРазмещения.ДатаРазмещения <> _УсловияВклада.ДатаРазмещения
				|			ИЛИ _ЗначенияРеквизитовРаспоряженияИРазмещения.ДоВостребования <> _УсловияВклада.ДоВостребования
				|			ИЛИ _ЗначенияРеквизитовРаспоряженияИРазмещения.Субординированность <> _УсловияВклада.Субординированность
				|			ИЛИ _ЗначенияРеквизитовРаспоряженияИРазмещения.ПроцентнаяСтавкаДоВостребования <> _УсловияВклада.ПроцентнаяСтавкаДоВостребования)
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ
				|	""Ошибка! Для депозитного вклада [%1] отсутствуют условия в регистре [Условия кредитных инструментов]."",
				|	_ЗначенияРеквизитовРаспоряженияИРазмещения.КредитныйИнструмент
				|ИЗ
				|	_ЗначенияРеквизитовРаспоряженияИРазмещения КАК _ЗначенияРеквизитовРаспоряженияИРазмещения
				|		ЛЕВОЕ СОЕДИНЕНИЕ _УсловияВклада КАК _УсловияВклада
				|		ПО _ЗначенияРеквизитовРаспоряженияИРазмещения.Распоряжение = _УсловияВклада.Распоряжение
				|ГДЕ
				|	_УсловияВклада.КредитныйИнструмент ЕСТЬ NULL
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ
				|	""Редактирование документа запрещено! На основании данных распоряжения сформированы условия для депозитного вклада [%1]."",
				|	_ЗначенияРеквизитовРаспоряженияИРазмещения.КредитныйИнструмент
				|ИЗ
				|	_ЗначенияРеквизитовРаспоряженияИРазмещения КАК _ЗначенияРеквизитовРаспоряженияИРазмещения
				|		ЛЕВОЕ СОЕДИНЕНИЕ _УсловияВклада КАК _УсловияВклада
				|		ПО _ЗначенияРеквизитовРаспоряженияИРазмещения.Распоряжение = _УсловияВклада.Распоряжение
				|ГДЕ
				|	НЕ _УсловияВклада.КредитныйИнструмент ЕСТЬ NULL
				|	И (_ЗначенияРеквизитовРаспоряженияИРазмещения.Процент <> _УсловияВклада.Процент
				|			ИЛИ _ЗначенияРеквизитовРаспоряженияИРазмещения.ДатаВозврата <> _УсловияВклада.ДатаВозврата
				|			ИЛИ _ЗначенияРеквизитовРаспоряженияИРазмещения.РасчетныйСчетВозвратаДенежныхСредств <> _УсловияВклада.РасчетныйСчетВозвратаДенежныхСредств
				|			ИЛИ _ЗначенияРеквизитовРаспоряженияИРазмещения.ПериодичностьВыплатыПроцентов <> _УсловияВклада.ПериодичностьВыплатыПроцентов)";
	#КонецОбласти 		
			
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			Запрос.УстановитьПараметр("ДатаРазмещения", ЭтотОбъект.ДатаРазмещения);

			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(Выборка.ТекстСообщения, Выборка.Параметр1),,,, Отказ);
			КонецЦикла;
			
		КонецЕсли;
		
		Если Не Отказ И (НачалоДня(ТекущаяДатаСеанса()) <= ЭтотОбъект.ДатаРазмещения) Тогда
		
			СоздатьОтложенноеЗаданиеКонтроляИД();
		
		КонецЕсли;
					
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Процедура СоздатьОтложенноеЗаданиеКонтроляИД()
	
	ИмяОбъекта = "_КонтрольИнвестиционныхДеклараций";  
	ДополнительнаяОбработкаСсылка = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьСсылкуПоИмениОбъекта(ИмяОбъекта);
	
	Если ДополнительнаяОбработкаСсылка = Неопределено Тогда
		ТекстОшибки = "Не удалось добавить отложенное задание контроля ИД по распоряжению на депозит. Обработка '" + ИмяОбъекта + "' не найдена";
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(ТекстОшибки, "Контроль инвестиционных деклараций");
		Возврат;
	КонецЕсли;
	
	ДатаЗапуска = ЭтотОбъект.ДатаРазмещения + 11 * 3600;
	
	Если ТекущаяДатаСеанса() > ДатаЗапуска Тогда
	
		//Устанавливаем время запуска так, чтобы оно было кратно 5 (17:10, 17:15, 17:20 и т.д.)
		//Если разница между текущим временем и ближайшим временем, которое кратно 5 больше 3 минут - устанавливаем ближайшее время кратное 5 (17:01 -> 07:05)
		//Если меньше 3 минут - сдвигаем на следующее время кратное 5 (17:04 - > 07:10)
		
		ДатаЗапуска = ТекущаяДатаСеанса();
		ДельтаМин = Минута(ДатаЗапуска) - (Цел(Минута(ДатаЗапуска) / 5) * 5);
	 	ДатаЗапуска = НачалоМинуты(ДатаЗапуска + 60 * (?(ДельтаМин >= 2, 10, 5) - ДельтаМин));		
	
	КонецЕсли;
	
	Параметры = Новый Структура("Организация, СчетДоверительногоУправления");
	ЗаполнитьЗначенияСвойств(Параметры, ЭтотОбъект);
	Параметры.Вставить("Период", ЭтотОбъект.ДатаРазмещения);
	
	Параметры.Вставить("ИсточникОшибки", "Контроль инвестиционных деклараций");
	Параметры.Вставить("ТекстОшибки", "Не удалось добавить отложенное задание '_КонтрольИнвестиционныхДеклараций.КонтрольДепозитов'.");
	
	РаботаСРегламентнымиЗаданиями.ДобавитьОтложенноеЗадание(ДополнительнаяОбработкаСсылка, "КонтрольДепозитов", Параметры, 5, Истина, ДатаЗапуска);
	
КонецПроцедуры
